Public Attributes | List of all members
API_ColumnSegmentQuantity Struct Reference
Element Manager API
Describes the different calculated values for column segments. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | veneerSideSurface
surface of the column segments side veneer
double  | veneerBottomSurface
surface of the column segments bottom veneer
double  | veneerTopSurface
surface of the column segments top veneer
double  | veneerGrossSurface
gross surface of the column segments veneer
double  | veneerGrossTopSurface
gross surface of the column segments top veneer
double  | veneerGrossBottomSurface
gross surface of the column segments bottom veneer
double  | coreGrossSurface
gross surface of the column segments core
double  | coreGrossTopSurface
gross surface of the column segments top core
double  | coreGrossBottomSurface
gross surface of the column segments bottom core
double  | grossVolume
gross volume of the column segment
double  | coreGrossVolume
gross volume of the column segments core
double  | veneerGrossVolume
gross volume of the column segments veneer
double  | coreNetBottomSurface
net surface of the column segments bottom core
double  | coreNetSurface
net surface of the column segments core
double  | coreNetTopSurface
net surface of the column segments top core
double  | coreVolume
volume of the column segments core
double  | veneerNetVolume
net volume of the column segments veneer
double  | length
length of the column segment
double  | area
area of the column segment
double  | volume
volume of the column segment
double  | crossSectionAreaCutBegin
area of the column segments begin cross section
double  | crossSectionAreaCutEnd
area of the column segments end cross section
double  | minHeight
minimum height of the column segment
double  | maxHeight
maximum height of the column segment
double  | height
height of the column segment
Detailed Description
Describes the different calculated values for column segments.
Member Data Documentation
◆ area
 API_ColumnSegmentQuantity::area
area of the column segment
◆ coreGrossBottomSurface
 API_ColumnSegmentQuantity::coreGrossBottomSurface
gross surface of the column segments bottom core
◆ coreGrossSurface
 API_ColumnSegmentQuantity::coreGrossSurface
gross surface of the column segments core
◆ coreGrossTopSurface
 API_ColumnSegmentQuantity::coreGrossTopSurface
gross surface of the column segments top core
◆ coreGrossVolume
 API_ColumnSegmentQuantity::coreGrossVolume
gross volume of the column segments core
◆ coreNetBottomSurface
 API_ColumnSegmentQuantity::coreNetBottomSurface
net surface of the column segments bottom core
◆ coreNetSurface
 API_ColumnSegmentQuantity::coreNetSurface
net surface of the column segments core
◆ coreNetTopSurface
 API_ColumnSegmentQuantity::coreNetTopSurface
net surface of the column segments top core
◆ coreVolume
 API_ColumnSegmentQuantity::coreVolume
volume of the column segments core
◆ crossSectionAreaCutBegin
 API_ColumnSegmentQuantity::crossSectionAreaCutBegin
area of the column segments begin cross section
◆ crossSectionAreaCutEnd
 API_ColumnSegmentQuantity::crossSectionAreaCutEnd
area of the column segments end cross section
◆ grossVolume
 API_ColumnSegmentQuantity::grossVolume
gross volume of the column segment
◆ height
 API_ColumnSegmentQuantity::height
height of the column segment
◆ length
 API_ColumnSegmentQuantity::length
length of the column segment
◆ maxHeight
 API_ColumnSegmentQuantity::maxHeight
maximum height of the column segment
◆ minHeight
 API_ColumnSegmentQuantity::minHeight
minimum height of the column segment
◆ veneerBottomSurface
 API_ColumnSegmentQuantity::veneerBottomSurface
surface of the column segments bottom veneer
◆ veneerGrossBottomSurface
 API_ColumnSegmentQuantity::veneerGrossBottomSurface
gross surface of the column segments bottom veneer
◆ veneerGrossSurface
 API_ColumnSegmentQuantity::veneerGrossSurface
gross surface of the column segments veneer
◆ veneerGrossTopSurface
 API_ColumnSegmentQuantity::veneerGrossTopSurface
gross surface of the column segments top veneer
◆ veneerGrossVolume
 API_ColumnSegmentQuantity::veneerGrossVolume
gross volume of the column segments veneer
◆ veneerNetVolume
 API_ColumnSegmentQuantity::veneerNetVolume
net volume of the column segments veneer
◆ veneerSideSurface
 API_ColumnSegmentQuantity::veneerSideSurface
surface of the column segments side veneer
◆ veneerTopSurface
 API_ColumnSegmentQuantity::veneerTopSurface
surface of the column segments top veneer
◆ volume
 API_ColumnSegmentQuantity::volume
volume of the column segment